app/controllers/movies_controller.rb

  def show
    @id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(@id) # look up movie by unique ID
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def similar
     @id = params[:movie_id]
     @movie = Movie.find(@id)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @movie = Movie.create!(params[:movie])
---
INSERT INTO "movies" ("created_at", "description", "director", "part_number", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)